app/controllers/readings_controller.rb

  def index
    @readings = Reading.all
---
SELECT "readings".* FROM "readings"

  def create
    temp = permitted_params[:Temperature]
    @reading = Reading.new(temperature: temp.to_f)
    if @reading.save
---
INSERT INTO "readings" ("created_at", "temperature", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-06-18 05:17:34.267756"], ["temperature", 500.0], ["updated_at", "2014-06-18 05:17:34.267756"]]